In [3]:
import pymysql

In [6]:
# create table in db.
def createTable():
    db = pymysql.connect("localhost", "root", "hsq888", "testschema") # 打开数据库连接
    cursor = db.cursor() # 使用 cursor()方法创建一个游标对象cursor
    cursor.execute("SELECT VERSION()")    # 使用 execute()方法执行 SQL 查询
    data = cursor.fetchone()    # 使用 fetchone()方法获取单条数据
    print("[createTable] Database version : {}".format(data))
    
    cursor = db.cursor() # 使用 cursor()方法创建一个游标对象cursor
    cursor.execute("DROP TABLE IF EXISTS EMPLOYEE")
    # 使用预处理语句创建表
    sql = """CREATE TABLE EMPLOYEE (
             FIRST_NAME  CHAR(20) NOT NULL,
             LAST_NAME  CHAR(20),
             AGE INT,  
             SEX CHAR(1),
             INCOME FLOAT )"""
    cursor.execute(sql)
    print("[createTable] create table done.")
    db.close()

createTable()

[createTable] Database version : ('5.7.17-log',)
[createTable] create table done.

In [ ]:
    # insert data into table
def insertTable():
    db = pymysql.connect("localhost", "root", "hsq888", "testschema")
    cursor = db.cursor()
    sql1 = "INSERT INTO EMPLOYEE(FIRST_NAME, \
       LAST_NAME, AGE, SEX, INCOME) \
       VALUES ('%s', '%s', '%d', '%c', '%d' )" % \
        ('Mac', 'Mohan', 20, 'M', 2000)
    ''
    sql2 = """INSERT INTO EMPLOYEE(FIRST_NAME,
         LAST_NAME, AGE, SEX, INCOME)
         VALUES ('Mac', 'Mohan', 20, 'M', 2000)"""
    ''
    try:
        cursor.execute(sql1)
        db.commit()         # 提交到数据库执行
    except:
        db.rollback()        # 如果发生错误则回滚
    db.close()

In [ ]:
# query table
def queryTable():
    db = pymysql.connect("localhost", "root", "hsq888", "testschema")
    cursor = db.cursor()
    sql = "SELECT * FROM EMPLOYEE \
           WHERE INCOME > '%d'" % (1000)
    try:
        cursor.execute(sql)
        results = cursor.fetchall()  # 获取所有记录列表
        for row in results:
            fname = row[0]
            lname = row[1]
            age = row[2]
            sex = row[3]
            income = row[4]
            print("fname=%s, lname=%s, age=%d, sex=%s, income=%d" %
                  (fname, lname, age, sex, income))
    except:
        print("Error: unable to fetch data")
    db.close()

In [ ]:
# update table
def updateTable():
    db = pymysql.connect("localhost", "root", "hsq888", "testschema")
    cursor = db.cursor()
    sql = "UPDATE EMPLOYEE SET AGE = AGE + 1 \
                              WHERE SEX = '%c'" % ('M')
    try:
        cursor.execute(sql)
        db.commit()
    except:
        db.rollback()
    db.close()
    pass

In [ ]:
# delete content in table
def deleteTable():
    db = pymysql.connect("localhost", "root", "hsq888", "testschema")
    cursor = db.cursor()
    sql = "DELETE FROM EMPLOYEE WHERE AGE > '%d'" % (20)
    try:
        cursor.execute(sql)
        db.commit()
    except:
        db.rollback()
    db.close()
    pass

### pandasql
http://blog.yhat.com/posts/pandasql-sql-for-pandas-dataframes.html

In [8]:
from pandasql import sqldf
from pandasql import load_meat, load_births

pysqldf = lambda q: sqldf(q, globals())
meat = load_meat()
births = load_births()
pysqldf("SELECT * FROM meat LIMIT 10;").head()

# 表关联
q = """SELECT m.date, m.beef, b.births FROM meat m INNER JOIN births b ON m.date = b.date;"""
joined = pysqldf(q), joined.head()
# 分组计算
q = "select strftime('%Y', date) as year , SUM(beef) as beef_total FROM meat GROUP BY year;"
pysqldf(q).head()

   year  beef_total
0  1944      8801.0
1  1945      9936.0
2  1946      9010.0
3  1947     10096.0
4  1948      8766.0